Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: If you want to remove a remote for some reason – you've moved the server or are no longer using a particular mirror, or perhaps a contributor isn't contributing anymore – you can use `git remote rm`:
cs: Chcete-li z nějakého důvodu odstranit referenci (přesunuli jste například server nebo už nepoužíváte dané zrcadlo, nebo třeba přispěvatel přestal přispívat), můžete využít příkaz `git remote rm`:

source: If you want to rename a file in Git, you can run something like:
cs: Chcete-li v systému Git přejmenovat soubor, můžete provést něco takového:

source: If you want to rename a reference you can run `git remote rename` to change a remote's shortname.(((git commands, remote))) For instance, if you want to rename `pb` to `paul`, you can do so with `git remote rename`:
cs: Pokud chcete odkaz přejmenovat, můžete zkrácené jméno vzdáleného repozitáře změnit příkazem `git remote rename`.(((git příkazy, remote))) Pokud například chcete přejmenovat `pb` na `paul`, můžete tak učinit příkazem `git remote rename`:

source: If you want to see a list of all the options your version of Git recognizes, you can run
cs: Pokud vás zajímá seznam parametrů, které vaše verze systému Git rozeznává, můžete si nechat jejich seznam vypsat příkazem:

source: If you want to see more information about a particular remote, you can use the `git remote show [remote-name]` command.(((git commands, remote))) If you run this command with a particular shortname, such as `origin`, you get something like this:
cs: Jestliže chcete získat více informací o konkrétním vzdáleném repozitáři, můžete použít příkaz `git remote show [název-vzdáleného-repozitáře]`.(((git příkazy, remote))) Pokud použijete tento příkaz v kombinaci s konkrétním zkráceným názvem (např. `origin`), bude výstup vypadat zhruba následovně:

source: If you want to see the changes introduced between the current version of a file and the file a month ago, Git can look up the file a month ago and do a local difference calculation, instead of having to either ask a remote server to do it or pull an older version of the file from the remote server to do it locally.
cs: Pokud si chcete prohlédnout změny provedené mezi aktuální verzí souboru a týmž souborem před měsícem, Git vyhledá měsíc starý soubor a provede lokální výpočet rozdílů, aniž by o to musel žádat vzdálený server nebo stahovat starší verzi souboru ze vzdáleného serveru a poté provádět lokální výpočet.

source: If you want to see the fifth prior value of the HEAD of your repository, you can use the `@{n}` reference that you see in the reflog output:
cs: Chcete-li zobrazit pátou poslední hodnotu ukazatele HEAD svého repozitáře, použijte referenci `@{n}` z výstupu reflog:

source: If you want to see what is in `master` or `experiment` but not any common references, you can run
cs: Chcete-li zjistit, co je ve větvi `master` nebo `experiment`, ale nechcete vidět jejich společné reference, zadejte příkaz:

source: If you want to see what tracking branches you have set up, you can use the `-vv` option to `git branch`.
cs: Pokud chcete vidět, jaké sledující větve máte nastaveny, můžete s příkazem `git branch` použít volbu `-vv`.

source: If you want to see what you've staged that will go into your next commit, you can use `git diff --staged`.
cs: Chcete-li vidět, co jste připravili a co bude součástí příští revize, použijte příkaz `git diff --staged`.

source: If you want to see which files are unmerged at any point after a merge conflict, you can run `git status`:
cs: Chcete-li kdykoli po konfliktu zjistit, které soubory zůstaly nesloučeny, spusťte příkaz `git status`:

source: If you want to skip the staging area, Git provides a simple shortcut.
cs: Chcete-li oblast připravených změn úplně přeskočit, nabízí Git jednoduchou zkratku.

source: If you want to start version-controlling existing files (as opposed to an empty directory), you should probably begin tracking those files and do an initial commit.
cs: Chcete-li zahájit správu verzí existujících souborů (a ne jen prázdného adresáře), měli byste pravděpodobně zahájit sledování (tracking) těchto souborů a zapsat první revizi (provést počáteční commit).

source: If you want to try that commit again, you can run commit with the `--amend` option:
cs: Chcete-li poslední revizi vytvořit znovu, můžete spustit příkaz `commit` s volbou `--amend`:

source: If you want to try this out, P4Merge works on all major platforms, so you should be able to do so.
cs: Pokud ho chcete vyzkoušet, nemělo by vám v tom nic bránit, P4Merge funguje na všech hlavních platformách.

source: If you want to unstage the TODO file at this point, you use the `3` or `r` (for revert) option:
cs: Chcete-li v tuto chvíli vrátit soubor TODO z oblasti připravených změn, použijte parametr `3` nebo `r` (jako „revert“ neboli „vrátit“):

source: If you want to use a different text editor, such as Emacs, you can do the following:
cs: Chcete-li používat jiný textový editor, například Emacs, můžete použít následující příkaz:

source: If you want to use a graphical tool to resolve these issues, you can run `git mergetool`, which fires up an appropriate visual merge tool and walks you through the conflicts:(((git commands, mergetool)))
cs: Chcete-li k vyřešení problémů použít grafický nástroj, můžete použít příkaz `git mergetool`, který spustí příslušný vizuální nástroj pro slučování, a ten vás všemi konflikty provede:(((git příkazy, mergetool)))

source: If you want to use a merge tool other than the default (Git chose `opendiff` in this case because the command was run on a Mac), you can see all the supported tools listed at the top after ``one of the following tools.'' Just type the name of the tool you'd rather use.
cs: Chcete-li pro slučování použít jiný než výchozí nástroj (Git v tomto případě vybral `opendiff`, protože byl příkaz spuštěn v systému Mac), naleznete všechny podporované nástroje na začátku výstupu v části „one of the following tools:“ („jeden z možných nástrojů“). Jednoduše napište jméno nástroje, který byste použili raději.

source: If you want to version-control Word documents, you can stick them in a Git repository and commit every once in a while; but what good does that do?
cs: Chcete-li verzovat dokumenty Word, můžete je uložit do repozitáře Git a všechny hned zapsat do revize. K čemu to však bude?

source: If you want to work on more than one branch simultaneously, you can set up local branches to `dcommit` to specific Subversion branches by starting them at the imported Subversion commit for that branch.
cs: Chcete-li současně pracovat ve více než jedné větvi, můžete nastavit lokální větve tak, abyste příkazem `dcommit` zapisovali revize do konkrétních větví Subversion. Za tímto účelem umístěte začátek větví na importované revizi Subversion pro tuto větev.

source: If you want totally up to date ahead and behind numbers, you'll need to fetch from all your remotes right before running this.
cs: Pokud chcete čerstvá čísla říkající, jak moc velký náskok máte a jak moc jste pozadu, musíte těsně před spuštěním tohoto příkazu vyzvednout data ze všech vzdálených repozitářů.

source: If you want your own `serverfix` branch that you can work on, you can base it off your remote-tracking branch:
cs: Pokud chcete mít svou vlastní větev `serverfix`, na které byste mohli pracovat, můžete ji odvodit ze vzdáleně sledované větve:

source: If you were deleting a reference, you would see the opposite: all '0's on the right side.
cs: Pokud byste mazali referenci, viděli byste pravý opak: samé nuly na pravé straně.

source: If you were working on an issue with a partner and they pushed up an `iss53` branch, you might have your own local `iss53` branch; but the branch on the server would point to the commit at `origin/iss53`.
cs: Pokud pracujete s kolegou na nějakém problému a on odešle (push) větev s názvem `iss53`, může se stát, že i vy máte jednu z lokálních větví pojmenovanou jako `iss53`. Větev na serveru však ukazuje na objekt revize označený jako `origin/iss53`.

source: If you would like to keep the changes you've made to that file but still need to get it out of the way for now, we'll go over stashing and branching in <<_git_branching>>; these are generally better ways to go.
cs: Pokud byste chtěli provedené změny souboru uchovat, ale pro tento okamžik je přesto chcete odklidit z cesty, podíváme se později na odkládání (stashing) a v kapitole <<_git_branching>> na větvení. Tyto postupy bývají většinou vhodnější.

source: If you're familiar with other VCS systems such as Subversion, you'll notice that the command is "clone" and not "checkout".
cs: Pokud jste zvyklí pracovat s jinými systémy pro správu verzí, jako je například Subversion, jistě jste si všimli, že příkaz zní `clone`, a nikoli `checkout`.

source: If you're happy with that, and you verify that everything that had conflicts has been staged, you can type `git commit` to finalize the merge commit.
cs: Pokud jste s výsledkem spokojeni a ujistili jste se, že všechny soubory s konfliktem jsou připraveny k zapsání, můžete zadat příkaz `git commit` a dokončit vytvoření bodu sloučení (merge commit).

source: If you're on Fedora for example, you can use yum:
cs: Pokud například používáte distribuci Fedora, můžete použít yum:

source: If you're on a Debian-based distribution like Ubuntu, try apt-get:
cs: V distribuci založené na Debianu (jako je například Ubuntu) zkuste použít program apt-get:

source: If you're on a tracking branch and type `git pull`, Git automatically knows which server to fetch from and branch to merge into.
cs: Pokud jste na sledující větvi a napíšete `git pull`, Git automaticky ví, z kterého serveru má data vyzvednout (fetch) a do jaké větve je začlenit (merge).

source: If you're only interested in looking at the 1.8.5 series, you can run this:
cs: Pokud se chcete podívat jen na sérii k verzi 1.8.5, můžete provést následující příkaz:

source: If you're starting to track an existing project in Git, you need to go to the project's directory and type:
cs: Chcete-li v Gitu zahájit sledování existujícího projektu, přejděte do adresáře projektu a napište:

source: If you're used to a CVCS where most operations have that network latency overhead, this aspect of Git will make you think that the gods of speed have blessed Git with unworldly powers.
cs: Pokud jste zvyklí pracovat s centralizovanými systémy správy verzí, kde je většina operací poznamenána latencí sítě, patrně vás při práci s Git napadne, že mu bohové rychlosti dali do vínku nadpřirozené schopnosti.

source: If you've cloned your repository, you should at least see origin – that is the default name Git gives to the server you cloned from:
cs: Pokud jste repozitář vytvořili klonováním, měli byste v něm vidět přinejmenším `origin` -- jako výchozí název ho Git přidělí serveru, ze kterého jste vytvářeli klon:

source: If you've made no changes since your last commit (for instance, you run this command immediately after your previous commit), then your snapshot will look exactly the same, and all you'll change is your commit message.
cs: Pokud jste od poslední revize neprovedli žádné změny (například spustíte tento příkaz bezprostředně po předchozím zápisu), bude snímek vypadat úplně stejně a jediné, co změníte, je zpráva k revizi.

source: If your fix for issue #53 modified the same part of a file as the `hotfix`, you'll get a merge conflict that looks something like this:
cs: Pokud se oprava problému #53 týkala stejné části souboru jako větev `hotfix`, dojde ke konfliktu při slučování (merge conflict), který vypadá nějak takto:

source: If you’ve been tracking files in your project and you want to move them out into a submodule, you must be careful or Git will get angry at you.
cs: Pokud jste ve svém projektu sledovali soubory a chcete je přesunout do submodulu, musíte být velmi opatrní, abyste si Git proti sobě nepoštvali.

source: If you’ve committed and then you want to change the snapshot you committed by adding or changing files, possibly because you forgot to add a newly created file when you originally committed, the process works basically the same way.
cs: Pokud jste zapsali revizi a uvědomíte si, že jste např. zapomněli přidat nově vytvořený soubor, a proto byste chtěli zapsaný snímek změnit (tedy přidat nebo změnit soubory), je postup ke změně v podstatě stejný.

source: In 2002, the Linux kernel project began using a proprietary DVCS called BitKeeper.(((BitKeeper)))
cs: V roce 2002 začal projekt linuxového jádra využívat komerční distribuovaný systém správy verzí s názvem BitKeeper.(((BitKeeper)))

source: In 2005, the relationship between the community that developed the Linux kernel and the commercial company that developed BitKeeper broke down, and the tool's free-of-charge status was revoked.
cs: Vztahy mezi komunitou, která vyvíjela jádro Linuxu, a komerční společností, která vyvinula BitKeeper, se v roce 2005 zhoršily a nástroj přestal být poskytován zdarma.

source: In <<_git_basics_chapter>>, you'll learn more about these states and how you can either take advantage of them or skip the staged part entirely.
cs: V kapitole <<_git_basics_chapter>> se o stavech souborů dozvíte více. Naučíte se, jak jich můžete využívat, nebo jak můžete stav „připraven k zapsání“ úplně přeskočit.

source: In <<limit_options>> we'll list these and a few other common options for your reference.
cs: Tabulka <<limit_options>> uvádí přehled již zmíněných a několika dalších voleb.

source: In Git, however, every developer is potentially both a node and a hub – that is, every developer can both contribute code to other repositories and maintain a public repository on which others can base their work and which they can contribute to.
cs: Naproti tomu v Gitu je každý vývojář potenciálním uzlem i úložištěm. To znamená, že každý vývojář může přispívat kódem do ostatních repozitářů a současně může spravovat veřejný repozitář, z kterého mohou ostatní vycházet při své práci a do kterého mohou přispívat.

source: In Git, this is a pointer to the local branch you're currently on.
cs: V Gitu se jedná o ukazatel na lokální větev, na níž se právě nacházíte.

source: In Git, this is called _rebasing_.
cs: V Gitu se to nazývá _přeskládáním_ (rebasing).

source: In Perforce, for example, you can't do much when you aren't connected to the server; and in Subversion and CVS, you can edit files, but you can't commit changes to your database (because your database is offline).
cs: Například v systému Perforce toho lze bez připojení k serveru dělat jen velmi málo. V systémech Subversion a CVS můžete sice upravovat soubory, ale nemůžete zapisovat změny do databáze (neboť ta je offline).

source: In Subversion, each person committing has a user on the system who is recorded in the commit information.
cs: V Subversion má každá osoba zapisující revize v systému přiděleného uživatele, který je u zaznamenán informací o revizi.

source: In `git svn`, it looks like this:
cs: V nástroji `git svn` to bude vypadat následovně:

source: In a DVCS (such as Git, Mercurial, Bazaar or Darcs), clients don't just check out the latest snapshot of the files: they fully mirror the repository.
cs: V distribuovaných systémech pro správu verzí (jako jsou Git, Mercurial, Bazaar nebo Darcs) klient nestahuje pouze nejnovější verzi souborů (tzv. snímek, anglicky snapshot), ale zrcadlí celý repozitář.

source: In addition to output-formatting options, `git log` takes a number of useful limiting options – that is, options that let you show only a subset of commits.
cs: Kromě voleb pro formátování výstupu akceptuje příkaz `git log` celou řadu užitečných omezujících voleb -- tj. takových, které umožní zobrazit jen podmnožinu revizí.

source: In addition to the client-side hooks, you can use a couple of important server-side hooks as a system administrator to enforce nearly any kind of policy for your project.
cs: Vedle zásuvných modulů na straně klienta můžete jako správce systému využívat také několik důležitých zásuvných modulů na straně serveru, které vám pomohou kontrolovat téměř jakýkoli typ standardů stanovených pro daný projekt.

source: In addition, each of these has subsettings you can use to set specific colors for parts of the output, if you want to override each color.
cs: Chcete-li sami nastavit jednotlivé barvy, mají všechny tyto parametry navíc dílčí nastavení, které můžete použít k určení konkrétních barev pro jednotlivé části výstupu.

source: In addition, the `short`, `full`, and `fuller` options show the output in roughly the same format but with less or more information, respectively:
cs: Dále se nabízejí hodnoty `short`, `full` a `fuller` (zkrácený, plný, úplný), které zobrazují výstup přibližně ve stejném formátu, avšak s více či méně podrobnými informacemi:

source: In addition, you get all this for very little overhead.
cs: To vše navíc získáte jen při velmi malém zvýšení režie.

source: In any case, the Git protocol is relatively easy to set up.
cs: Ať tak či tak, na protokolu Git jistě oceníte jeho snadné nastavení.

source: In centralized systems, every developer is a node working more or less equally on a central hub.
cs: V centralizovaných systémech představuje každý vývojář samostatný uzel, pracující s centrálním úložištěm více či méně na stejné úrovni.

source: In essence, you want to treat it like a binary file.
cs: Z těchto důvodů s ním budete chtít zacházet jako s binárním souborem.

source: In fact, Git stores everything in its database not by file name but by the hash value of its contents.
cs: Git vlastně ve své databázi nic neukládá podle názvu souboru, ale podle otisku jeho obsahu.

source: In fact, if you build Git from source code cloned from the Git repository, `git --version` gives you something that looks like this.
cs: Pokud sestavujete Git ze zdrojového kódu naklonovaného z repozitáře Git, získáte po spuštění příkazu `git --version` něco, co vypadá zhruba podobně.

source: In fact, if you have a script that will exit 0 if the project is good or non-0 if the project is bad, you can fully automate `git bisect`.
cs: A máte-li skript, který bude pro správně fungující projekt vracet hodnotu 0 (nula), nebo nenulovou hodnotu, pokud je v projektu chyba, můžete příkaz `git bisect` dokonce plně automatizovat.

source: In fact, if you run something like this and look at the status, you'll see that Git considers it a renamed file:
cs: A skutečně, pokud takový příkaz provedete a podíváte se na hlášení o stavu, uvidíte, že Git považuje soubor za přejmenovaný (renamed):

source: In fact, if your server disk gets corrupted, you can often use nearly any of the clones on any client to set the server back to the state it was in when it was cloned (you may lose some server-side hooks and such, but all the versioned data would be there – see <<_git_on_the_server>> for more details).
cs: Pokud by někdy poté došlo k poruše disku serveru, lze použít libovolný z těchto klonů na kterémkoli klientovi a obnovit pomocí něj server zpět do stavu, v němž byl v okamžiku klonování (může dojít ke ztrátě některých zásuvných modulů na straně serveru a podobných věcí, ale všechna verzovaná data budou obnovena. Další podrobnosti naleznete v kapitole <<_git_on_the_server>>).

source: In fact, this is so common that there's even a shortcut for that shortcut.
cs: Ve skutečnosti je to tak běžná operace, že existuje dokonce zkrácená varianta pro tento zkratkový příkaz.

source: In fact, you can do `-<n>`, where `n` is any integer to show the last `n` commits.
cs: Můžete dokonce zadat `-<n>`, kde `n` je libovolné celé číslo. Povede to k zobrazení posledních `n` revizí.

source: In general the way to get the best of both worlds is to rebase local changes you've made but haven't shared yet before you push them in order to clean up your story, but never rebase anything you've pushed somewhere.
cs: Obecně můžete nejlepší z obou světů získat tím, že použijete přeskládání vašich lokálních změn, které jste dosud nezveřejnili, abyste příběh vyčistili, než jej zveřejníte. Ale nikdy neprovádějte přeskládání toho, co už bylo někam odesláno.

source: In many VCS tools, this is a somewhat expensive process, often requiring you to create a new copy of your source code directory, which can take a long time for large projects.
cs: V mnoha nástrojích pro správu verzí jde o poněkud náročný proces, který často vyžaduje vytvoření nové kopie adresáře se zdrojovým kódem, což může u velkých projektů trvat dlouho.

source: In many instances, you'll have two or three developers with a few commits a day, or possibly less for somewhat dormant projects.
cs: V mnoha případech budete mít dva nebo tři vývojáře přispívající několika málo revizemi denně. U spících projektů to bude i méně.

source: In many other systems, doing so is either impossible or painful.
cs: V mnoha jiných systémech je takový postup nemožný nebo přinejmenším obtížný.

source: In order to be able to add the documentation in various formats (doc, html, info), these additional dependencies are required (Note: users of RHEL and RHEL-derivatives like CentOS and Scientific Linux will have to https://fedoraproject.org/wiki/EPEL#How_can_I_use_these_extra_packages.3F[enable the EPEL repository] to download the `docbook2X` package):
cs: Pokud chcete pracovat s dokumentací v rozličných formátech (doc, html, info), vyžadují se následující závislosti (Poznámka: uživatelé distribuce RHEL a odvozených, jako je CentOS a Scientific Linux, budou muset https://fedoraproject.org/wiki/EPEL#How_can_I_use_these_extra_packages.3F[povolit repozitář EPEL], aby mohli stáhnout balíček `docbook2X`):

source: In order to begin tracking a new file, you use the command `git add`.(((git commands, add))) To begin tracking the README file, you can run this:
cs: K zahájení sledování nových souborů se používá příkaz `git add`.(((git příkazy, add))) Sledování souboru `README` zahájíme takto:

source: In order to do that, you'll merge your `iss53` branch into `master`, much like you merged your `hotfix` branch earlier.
cs: Abychom tak učinili, začleníme větev `iss53` do větve `master` podobně, jako jsme to učinili dříve s větví `hotfix`.

source: In order to import a Git directory, you need to review how Git stores its data.
cs: Chcete-li importovat adresář Git, budeme se muset podívat na to, jak Git ukládá svá data.

source: In order to resolve the conflict, you have to either choose one side or the other or merge the contents yourself.
cs: Chcete-li vzniklý konflikt vyřešit, musíte buď vybrat jednu z obou možností, nebo je ručně spojit dohromady.

source: In other words, in this case, you don't have a new `serverfix` branch – you only have an `origin/serverfix` pointer that you can't modify.
cs: Jinými slovy, v tomto případě nevznikne nová větev `serverfix`. Získáte jen ukazatel `origin/serverfix`, který nemůžete měnit.

source: In other words, use commands.
cs: Jinými slovy, formulujte je jako příkazy.

source: In other words, you may want to keep the file on your hard drive but not have Git track it anymore.
cs: Jinými slovy, soubor chcete ponechat na disku, ale už nechcete, aby ho Git sledoval.

source: In reality, we're talking about pointers moving up the line of commits you're making.
cs: Ve skutečnosti hovoříme o ukazatelích pohybujících se vzhůru po linii revizí, které zapisujete.

source: In reality, you're unlikely to use that often, because Git by default pipes all output through a pager so you see only one page of log output at a time.
cs: Ve skutečnosti ji asi nebudete využívat příliš často, protože Git standardně posílá výstup přes stránkovač, takže se najednou zobrazí jen jedna stránka logu.

source: In some contexts, the first line is treated as the subject of an email and the rest of the text as the body.
cs: Někdy se první řádek používá jako předmět emailu a zbytek textu jako tělo dopisu.
